brew "bat"
brew "eza"
brew "fd"
brew "fish" if OS.mac?
cask "font-jetbrains-mono-nerd-font" if OS.mac?
brew "fzf"
brew "gitui"
brew "helix"
brew "htop"
brew "patchutils" if OS.mac?
brew "ripgrep"
brew "starship"
brew "wget" if OS.mac?
brew "zoxide"

# Bash
brew "bash-language-server"
brew "shellcheck"
brew "shfmt"
