hostname = `hostname -s`.strip

brew "bat"
brew "eza"
brew "fish" if OS.mac?
cask "font-monaspace" if OS.mac?
brew "gh" if hostname == "rutherford"
brew "gitui"
brew "helix"
brew "htop"
brew "patchutils" if OS.mac?
brew "stow" if OS.mac?
brew "wget" if OS.mac?
brew "zoxide"

# Bash
brew "bash-language-server"
brew "shellcheck"
brew "shfmt"
